export const state = () => ({
  questionList: [
    {
      title: 'მონაწილეობა მთავრობამ არსებად, გარკვეულიყო ბაბილონი იტორტმანა?',
      content:
        'შესაძლებლობა გაქვთ მოიძიოთ თქვენთვის  სასურველი ბინა, აირჩიე სასურველირენდერი ანმოძებნე დეტალურად შენი  პრიორიტეტებისა დასურვილების მიხედვით გთხოვთ აირჩიოთ სასურველი ძებნის მეთოდი ნე დეტალურად შენი  პრიორიტეტებისა გთხოვთ აირჩიოთ სასურველი ძებნის მეთოდი აირჩიოთ სასურველი ძებნის მეთოდი ნე დეტალურად შენი  პრიორიტეტებისა დასურვილების '
    },
    {
      title: 'მონაწილეობა მთავრობამ არსებად, გარკვეულიყო ბაბილონი იტორტმანა?',
      content:
        'იორიტეტებისა დასურვილების მიხედვით გთხოვთ აირჩიოთ სასურველი ძებნის მეთოდი ნე დეტალურად შენი  პრიორიტეტებისა გთხოვთ აირჩიოთ სასურველი ძებნის მეთოდი აირჩიოთ სასურველი ძებნის მეთოდი ნე დეტალურად შენი  პრიორიტეტებისა დასურვილების '
    },
    {
      title: 'მონაწილეობა მთავრობამ არსებად, გარკვეულიყო ბაბილონი იტორტმანა?',
      content:
        'შესაძლებლობა  დეტალურად შენი  პრიორიტეტებისა დასურვილების მიხედვით გთხოვთ აირჩიოთ სასურველი ძებნის მეთოდი ნე დეტალურად შენი  პრიორიტეტებისა გთხოვთ აირჩიოთ სასურველი ძებნის მეთოდი აირჩიოთ სასურველი ძებნის მეთოდი ნე დეტალურად შენი  პრიორიტეტებისა დასურვილების '
    },
    {
      title: 'მონაწილეობა მთავრობამ არსებად, გარკვეულიყო ბაბილონი იტორტმანა?',
      content:
        'შესაძლებლობა გაქვთ მოიძიოთ თქ დასურვილების მიხედვით გთხოვთ აირჩიოთ სასურველი ძებნის მეთოდი ნე დეტალურად შენი  პრიორიტეტებისა გთხოვთ აირჩიოთ სასურველი ძებნის მეთოდი აირჩიოთ სასურველი ძებნის მეთოდი ნე დეტალურად შენი  პრიორიტეტებისა დასურვილების '
    },
    {
      title: 'მონაწილეობა მთავრობამ არსებად, გარკვეულიყო ბაბილონი იტორტმანა?',
      content:
        'შესაძლებლობა გაქვთ მოიძიოთ თქვენთვის  სასურველი ბინა, აირჩიე სასურველირენდერი ანმოძებნე დეტალურად შენი  პრიორიტეტებისა დასურვილების მიხედვით გთხოვთ აირჩიოთ სასურველი ძებნის მეთოდი ნე დეტალურად შენი  პრიორიტეტებისა გთხოვთ აირჩიოთ სასურველი ძებნის მეთოდი აირჩიოთ სასურველი ძებნის მეთოდი ნე დეტალურად შენი  პრიორიტეტებისა დასურვილების '
    },
    {
      title: 'მონაწილეობა მთავრობამ არსებად, გარკვეულიყო ბაბილონი იტორტმანა?',
      content:
        'შესაძლებლობა გაქვთ მოიძიოტეტებისა დასურვილების მიხედვით გთხოვთ აირჩიოთ სასურველი ძებნის მეთოდი ნე დეტალურად შენი  პრიორიტეტებისა გთხოვთ აირჩიოთ სასურველი ძებნის მეთოდი აირჩიოთ სასურველი ძებნის მეთოდი ნე დეტალურად შენი  პრიორიტეტებისა დასურვილების '
    },
    {
      title: 'მონაწილეობა მთავრობამ არსებად, გარკვეულიყო ბაბილონი იტორტმანა?',
      content:
        'შესაძლებლობა გაქვთ მოიძიოთ თქვენთვის  სასურველი ბინა, აირჩიე სასურველირენდერი ანმოძებნე დეტალურად შენი  პრიორიტეტებისა დასურვილების მიხედვით გთხოვთ აირჩიოთ სასურველი ძებნის მეთოდი ნე დეტალურად შენი  პრიორიტეტებისა გთხოვთ აირჩიოთ სასურველი ძებნის მეთოდი აირჩიოთ სასურველი ძებნის მეთოდი ნე დეტალურად შენი  პრიორიტეტებისა დასურვილების '
    }
  ]
})

export const getters = {
  questionList: (state) => state.questionList
}

export const mutations = {
  SET_QUESTION_LIST: (state, data) => {
    state.questionList = data
  }
}

export const actions = {
  fetchFAQ: () => {
    return new Promise((resolve, reject) => {
      console.log('fetched items')
    })
  }
}
