/* eslint-disable prettier/prettier */
export const state = () => ({
    itemList: [
        {
            id: 1,
            title: 'ჯინჯერი',
            text:
                'შემთხვევითად გენერირებული ტექსტი ეხმარება დიზაინერებს და ტიპოგრაფიული ნაწარმის შემქმნელებს, რეალურთან მაქსიმალურად',
            image: 'https://via.placeholder.com/300x380'
        },
        {
            id: 2,
            title: 'ჯინჯერი',
            text:
                'შემთხვევითად გენერირებული ტექსტი ეხმარება დიზაინერებს და ტიპოგრაფიული ნაწარმის შემქმნელებს, რეალურთან მაქსიმალურად მიახლოებული შაბლონი წარუდგინონ შემფასებელს. ხშირადაა შემთხვევა, როდესაც დიზაინის შესრულებისას საჩვენებელია.',
            image: 'https://via.placeholder.com/680x380'
        },
        {
            id: 3,
            title: 'რაცხა',
            text:
                'შემთხვევითად გენერირებული ტექსტი ეხმარება დიზაინერებს და ტიპოგრაფიული ნაწარმის მოყენება, რადგან უბრალოდ „ტექსტი ტექსტი ტექსტი“ ან სხვა გამეორებადი სიტყვების ჩაყრა, ხელოვნურ ვიზუალურ სიმეტრიას ქმნის და არაბუნებრივად გამოიყურება.',
            image: 'https://via.placeholder.com/680x380'
        }
    ]
});

export const getters = {
    itemList: (state) => {
        return state.itemList;
    }
}

export const mutations = {

}

export const actions = {}
