<template>
  <div class="faq-slider">
    <div v-swiper:faqSwiper="swiperOption" ref="mySwiper" @someSwiperEvent="callback">
      <div class="swiper-wrapper">
        <div v-for="(item, index) in items" :key="index" class="swiper-slide faq-slider__swiper-slide">
          <h3>{{ item.title }}</h3>
          <p>{{ item.content }}</p>
        </div>
      </div>
    </div>
  </div>
</template>
<script>
// import { swiper, swiperSlide } from 'vue-awesome-swiper'

export default {
  // components: { swiper, swiperSlide },
  data() {
    return {
      swiperOption: {
        pagination: {
          el: '.swiper-pagination'
        }
      },
      items: [
        {
          title: 'მონაწილეობა მთავრობამ არსებად, გარკვეულიყო ბაბილონი იტორტმანა?',
          content: 'შესაძლებლობა გაქვთ მოიძიოთ თქვენთვის  სასურველი ბინა, აირჩიე სასურველირენდერი ანმოძებნე დეტალურად შენი  პრიორიტეტებისა დასურვილების მიხედვით გთხოვთ აირჩიოთ სასურველი ძებნის მეთოდი ნე დეტალურად შენი  პრიორიტეტებისა გთხოვთ აირჩიოთ სასურველი ძებნის მეთოდი აირჩიოთ სასურველი ძებნის მეთოდი ნე დეტალურად შენი  პრიორიტეტებისა დასურვილების '
        },
        {
          title: 'მონაწილეობა მთავრობამ არსებად, გარკვეულიყო ბაბილონი იტორტმანა?',
          content: 'შესაძლებლობა გაქვთ მოიძიოთ თქვენთვის  სასურველი ბინა, აირჩიე სასურველირენდერი ანმოძებნე დეტალურად შენი  პრიორიტეტებისა დასურვილების მიხედვით გთხოვთ აირჩიოთ სასურველი ძებნის მეთოდი ნე დეტალურად შენი  პრიორიტეტებისა გთხოვთ აირჩიოთ სასურველი ძებნის მეთოდი აირჩიოთ სასურველი ძებნის მეთოდი ნე დეტალურად შენი  პრიორიტეტებისა დასურვილების '
        },
        {
          title: 'მონაწილეობა მთავრობამ არსებად, გარკვეულიყო ბაბილონი იტორტმანა?',
          content: 'შესაძლებლობა გაქვთ მოიძიოთ თქვენთვის  სასურველი ბინა, აირჩიე სასურველირენდერი ანმოძებნე დეტალურად შენი  პრიორიტეტებისა დასურვილების მიხედვით გთხოვთ აირჩიოთ სასურველი ძებნის მეთოდი ნე დეტალურად შენი  პრიორიტეტებისა გთხოვთ აირჩიოთ სასურველი ძებნის მეთოდი აირჩიოთ სასურველი ძებნის მეთოდი ნე დეტალურად შენი  პრიორიტეტებისა დასურვილების '
        },
        {
          title: 'მონაწილეობა მთავრობამ არსებად, გარკვეულიყო ბაბილონი იტორტმანა?',
          content: 'შესაძლებლობა გაქვთ მოიძიოთ თქვენთვის  სასურველი ბინა, აირჩიე სასურველირენდერი ანმოძებნე დეტალურად შენი  პრიორიტეტებისა დასურვილების მიხედვით გთხოვთ აირჩიოთ სასურველი ძებნის მეთოდი ნე დეტალურად შენი  პრიორიტეტებისა გთხოვთ აირჩიოთ სასურველი ძებნის მეთოდი აირჩიოთ სასურველი ძებნის მეთოდი ნე დეტალურად შენი  პრიორიტეტებისა დასურვილების '
        },
        {
          title: 'მონაწილეობა მთავრობამ არსებად, გარკვეულიყო ბაბილონი იტორტმანა?',
          content: 'შესაძლებლობა გაქვთ მოიძიოთ თქვენთვის  სასურველი ბინა, აირჩიე სასურველირენდერი ანმოძებნე დეტალურად შენი  პრიორიტეტებისა დასურვილების მიხედვით გთხოვთ აირჩიოთ სასურველი ძებნის მეთოდი ნე დეტალურად შენი  პრიორიტეტებისა გთხოვთ აირჩიოთ სასურველი ძებნის მეთოდი აირჩიოთ სასურველი ძებნის მეთოდი ნე დეტალურად შენი  პრიორიტეტებისა დასურვილების '
        },
        {
          title: 'მონაწილეობა მთავრობამ არსებად, გარკვეულიყო ბაბილონი იტორტმანა?',
          content: 'შესაძლებლობა გაქვთ მოიძიოთ თქვენთვის  სასურველი ბინა, აირჩიე სასურველირენდერი ანმოძებნე დეტალურად შენი  პრიორიტეტებისა დასურვილების მიხედვით გთხოვთ აირჩიოთ სასურველი ძებნის მეთოდი ნე დეტალურად შენი  პრიორიტეტებისა გთხოვთ აირჩიოთ სასურველი ძებნის მეთოდი აირჩიოთ სასურველი ძებნის მეთოდი ნე დეტალურად შენი  პრიორიტეტებისა დასურვილების '
        }
      ]
    }
  }
}
</script>
<style lang="scss" scoped>
.faq-slider {
  overflow: hidden;
}
</style>
